{
  "_meta": {
    "sources": [
      {
        "json": "nhb",
        "abbreviation": "NHB",
        "full": "Nick's Homebrew",
        "url": "",
        "authors": [
          "Nick"
        ],
        "convertedBy": []
      }
    ],
    "dateAdded": 1623334421,
    "dateLastModified": 1623488756
  },
  "item": [
    {
      "name": "Tiny Fire Elemental Lantern",
      "source": "nhb",
      "srd": false,
      "tier": "major",
      "rarity": "rare",
      "reqAttune": true,
      "wondrous": true,
      "weight": 5,
      "entries": [
        "While lit, you can use an action to summon a {@creature tiny fire elemental} for up to one hour. The lantern can't be used this way again until the next dawn."
      ]
    }
  ],
  "monster": [
    {
      "name": "Deimos",
      "source": "nhb",
      "size": "M",
      "type": "undead",
      "alignment": [
        "L",
        "NX",
        "C",
        "E"
      ],
      "ac": [
        {
          "ac": 17,
          "from": [
            "natural armor"
          ]
        }
      ],
      "hp": {
        "formula": "30d8 + 90",
        "average": 225
      },
      "speed": {
        "walk": 30
      },
      "str": 11,
      "dex": 16,
      "con": 16,
      "int": 20,
      "wis": 14,
      "cha": 16,
      "save": {
        "con": "+10",
        "int": "+12",
        "wis": "+9"
      },
      "skill": {
        "arcana": "+19",
        "history": "+12",
        "insight": "+9",
        "perception": "+9"
      },
      "senses": [
        "truesight 120 ft."
      ],
      "passive": 19,
      "resist": [
        "cold",
        "lightning",
        "necrotic"
      ],
      "immune": [
        "poison",
        {
          "immune": [
            "bludgeoning",
            "piercing",
            "slashing"
          ],
          "note": "from nonmagical attacks",
          "cond": true
        }
      ],
      "conditionImmune": [
        "charmed",
        "exhaustion",
        "frightened",
        "paralyzed",
        "poisoned"
      ],
      "languages": [
        "Common plus up to five other languages"
      ],
      "cr": {
        "cr": "21",
        "lair": "22"
      },
      "spellcasting": [
        {
          "name": "Spellcasting",
          "headerEntries": [
            "Deimos is an 18th-level spellcaster. His spellcasting ability is Intelligence (spell save {@dc 20}, {@hit 12} to hit with spell attacks). Deimos has the following wizard spells prepared:"
          ],
          "spells": {
            "0": {
              "spells": [
                "{@spell mage hand}",
                "{@spell prestidigitation}",
                "{@spell ray of frost}",
                "{@spell toll the dead|XGE}"
              ]
            },
            "1": {
              "spells": [
                "{@spell detect magic}",
                "{@spell ice knife|XGE}",
                "{@spell magic missile}",
                "{@spell shield}",
                "{@spell thunderwave}"
              ],
              "slots": 4
            },
            "2": {
              "spells": [
                "{@spell detect thoughts}",
                "{@spell invisibility}",
                "{@spell Melf's acid arrow}",
                "{@spell mirror image}"
              ],
              "slots": 3
            },
            "3": {
              "spells": [
                "{@spell animate dead}",
                "{@spell counterspell}",
                "{@spell dispel magic}",
                "{@spell fireball}",
                "{@spell haste}",
                "{@spell slow}"
              ],
              "slots": 3
            },
            "4": {
              "spells": [
                "{@spell blight}",
                "{@spell dimension door}",
                "{@spell ice storm}"
              ],
              "slots": 3
            },
            "5": {
              "spells": [
                "{@spell cloudkill}",
                "{@spell cone of cold}",
                "{@spell scrying}",
                "{@spell steel wind strike|XGE}"
              ],
              "slots": 3
            },
            "6": {
              "spells": [
                "{@spell circle of death}",
                "{@spell disintegrate}",
                "{@spell globe of invulnerability}",
                "{@spell wall of ice}"
              ],
              "slots": 1
            },
            "7": {
              "spells": [
                "{@spell finger of death}",
                "{@spell plane shift}",
                "{@spell teleport}"
              ],
              "slots": 1
            },
            "8": {
              "spells": [
                "{@spell dominate monster}",
                "{@spell power word stun}"
              ],
              "slots": 1
            },
            "9": {
              "spells": [
                "{@spell blade of disaster|TCE}",
                "{@spell imprisonment}",
                "{@spell power word kill}",
                "{@spell time stop}"
              ],
              "slots": 1
            }
          },
          "ability": "int",
          "type": "spellcasting"
        }
      ],
      "trait": [
        {
          "name": "Legendary Resistance (3/Day)",
          "entries": [
            "If Deimos fails a saving throw, he can choose to succeed instead."
          ]
        },
        {
          "name": "Rejuvenation",
          "entries": [
            "If he has a phylactery, if killed Deimos gains a new body in {@dice 1d10} days, regaining all his hit points and becoming active again. The new body appears within 5 feet of the phylactery."
          ]
        },
        {
          "name": "Turn Resistance",
          "entries": [
            "Deimos has advantage on saving throws against any effect that turns undead."
          ]
        },
        {
          "name": "Items",
          "entries": [
            "Deimos is carrying and attuned to the following items: {@item amulet of proof against detection and location}, {@item ring of mind shielding} and {@item staff of power}"
          ]
        }
      ],
      "action": [
        {
          "name": "Paralyzing Touch",
          "entries": [
            "{@atk ms} {@hit 12} to hit, reach 5 ft., one creature. {@h}10 ({@damage 3d6}) cold damage. The target must succeed on a {@dc 18} Constitution saving throw or be {@condition paralyzed} for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
          ]
        }
      ],
      "legendary": [
        {
          "name": "Cantrip",
          "entries": [
            "Deimos casts a cantrip."
          ]
        },
        {
          "name": "Paralyzing Touch (Costs 2 Actions)",
          "entries": [
            "Deimos uses his Paralyzing Touch."
          ]
        },
        {
          "name": "Frightening Gaze (Costs 2 Actions)",
          "entries": [
            "Deimos fixes its gaze on one creature it can see within 10 feet of it. The target must succeed on a {@dc 18} Wisdom saving throw against this magic or become {@condition frightened} for 1 minute. The {@condition frightened} target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to Deimos' gaze for the next 24 hours."
          ]
        },
        {
          "name": "Disrupt Life (Costs 3 Actions)",
          "entries": [
            "Each non-undead creature within 20 feet of Deimos must make a {@dc 18} Constitution saving throw against this magic, taking 21 ({@damage 6d6}) necrotic damage on a failed save, or half as much damage on a successful one."
          ]
        }
      ],
      "legendaryGroup": {
        "name": "Lich",
        "source": "MM"
      },
      "traitTags": [
        "Legendary Resistances",
        "Rejuvenation",
        "Turn Resistance"
      ],
      "senseTags": [
        "U"
      ],
      "languageTags": [
        "C",
        "X"
      ],
      "damageTags": [
        "C",
        "N"
      ],
      "spellcastingTags": [
        "CW"
      ],
      "conditionInflict": [
        "paralyzed",
        "frightened"
      ],
      "conditionInflictSpell": [
        "charmed",
        "invisible",
        "stunned"
      ],
      "hasFluff": true,
      "hasFluffImages": true,
      "tokenUrl": "https://raw.githubusercontent.com/heisch/dnd_homebrew_content/main/img/deimos_token.png",
      "fluff": {
        "entries": [
          {
            "type": "entries",
            "entries": [
              {
                "type": "entries",
                "entries": [
                  "Liches are the remains of great wizards who embrace undeath as a means of preserving themselves. They further their own power at any cost, having no interest in the affairs of the living except where those affairs interfere with their own. Scheming and insane, they hunger for long-forgotten knowledge and the most terrible secrets. Because the shadow of death doesn't hang over them, they can conceive plans that take years, decades, or centuries to come to fruition.",
                  "A lich is a gaunt and skeletal humanoid with withered flesh stretched tight across its bones. Its eyes succumbed to decay long ago, but points of light burn in its empty sockets. It is often garbed in the moldering remains of fine clothing and jewelry worn and dulled by the passage of time.",
                  {
                    "name": "Secrets of Undeath",
                    "type": "entries",
                    "entries": [
                      "No wizard takes up the path to lichdom on a whim, and the process of becoming a lich is a well-guarded secret. Wizards that seek lichdom must make bargains with fiends, evil gods, or other foul entities. Many turn to Orcus, Demon Prince of Undeath, whose power has created countless liches. However, those that control the power of lichdom always demand fealty and service for their knowledge.",
                      "A lich is created by an arcane ritual that traps the wizard's soul within a phylactery. Doing so binds the soul to the mortal world, preventing it from traveling to the Outer Planes after death. A phylactery is traditionally an amulet in the shape of a small box, but it can take the form of any item possessing an interior space into which arcane sigils of naming, binding, immortality, and dark magic are scribed in silver.",
                      "With its phylactery prepared, the future lich drinks a potion of transformation-a vile concoction of poison mixed with the blood of a sentient creature whose soul is sacrificed to the phylactery. The wizard falls dead, then rises as a lich as its soul is drawn into the phylactery, where it forever remains."
                    ]
                  },
                  {
                    "name": "Soul Sacrifices",
                    "type": "entries",
                    "entries": [
                      "A lich must periodically feed souls to its phylactery to sustain the magic preserving its body and consciousness. It does this using the {@spell imprisonment} spell. Instead of choosing one of the normal options of the spell, the lich uses the spell to magically trap the target's body and soul inside its phylactery. The phylactery must be on the same plane as the lich for the spell to work. A lich's phylactery can hold only one creature at a time, and a dispel magic cast as a 9th-level spell upon the phylactery releases any creature imprisoned within it. A creature imprisoned in the phylactery for 24 hours is consumed and destroyed utterly, whereupon nothing short of divine intervention can restore it to life.",
                      "A lich that fails or forgets to maintain its body with sacrificed souls begins to physically fall apart, and might eventually become a demilich."
                    ]
                  },
                  {
                    "name": "Death and Restoration",
                    "type": "entries",
                    "entries": [
                      "When a lich's body is broken by accident or assault, the will and mind of the lich drains from it, leaving only a lifeless corpse behind. Within days, a new body reforms next to the lich's phylactery, coalescing out of glowing smoke that issues from the device. Because the destruction of its phylactery means the possibility of eternal death, a lich usually keeps its phylactery in a hidden, well-guarded location.",
                      "Destroying a lich's phylactery is no easy task and often requires a special ritual, item, or weapon. Every phylactery is unique, and discovering the key to its destruction can be a quest in and of itself."
                    ]
                  },
                  {
                    "name": "Lonely Existence",
                    "type": "entries",
                    "entries": [
                      "From time to time, a lich might be stirred from its single-minded pursuit of power to take an interest in the world around it, most often when some great event reminds it of the life it once led. It otherwise lives in isolation, engaging only with those creatures whose service helps secure its lair.",
                      "Few liches call themselves by their former names, instead adopting monikers such as the Black Hand or the Forgotten King."
                    ]
                  },
                  {
                    "name": "Magic Collectors",
                    "type": "entries",
                    "entries": [
                      "Liches collect spells and magic items. In addition to its spell repertoire, a lich has ready access to potions, scrolls, libraries of spellbooks, one or more wands, and perhaps a staff or two. It has no qualms about putting these treasures to use whenever its lair comes under attack."
                    ]
                  },
                  {
                    "name": "Undead Nature",
                    "type": "entries",
                    "entries": [
                      "A lich doesn't require air, food, drink, or sleep."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "A Lich's Lair",
                    "entries": [
                      "A lich often haunts the abode it favored in life, such as a lonely tower, a haunted ruin, or an academy of black magic. Alternatively, some liches construct secret tombs filled with powerful guardians and traps. Everything about a lich's lair reflects its keen mind and wicked cunning, including the magic and mundane traps that secure it. Undead, constructs, and bound demons lurk in shadowy recesses, emerging to destroy those who dare to disturb the lich's work.",
                      "A lich encountered in its lair has a challenge rating of 22 (41,000 XP)."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "type": "entries",
            "entries": [
              {
                "type": "entries",
                "name": "Lair Actions",
                "entries": [
                  "On initiative count 20 (losing initiative ties), the lich can take a lair action to cause one of the following magical effects; the lich can't use the same effect two rounds in a row:",
                  {
                    "type": "list",
                    "items": [
                      "The lich rolls a {@dice d8} and regains a spell slot of that level or lower. If it has no spent spell slots of that level or lower, nothing happens.",
                      "The lich targets one creature it can see within 30 feet of it. A crackling cord of negative energy tethers the lich to the target. Whenever the lich takes damage, the target must make a {@dc 18} Constitution saving throw. On a failed save, the lich takes half the damage (rounded down), and the target takes the remaining damage. This tether lasts until initiative count 20 on the next round or until the lich or the target is no longer in the lich's lair.",
                      "The lich calls forth the spirits of creatures that died in its lair. These apparitions materialize and attack one creature that the lich can see within 60 feet of it. The target must succeed on a {@dc 18} Constitution saving throw, taking 52 ({@damage 15d6}) necrotic damage on a failed save, or half as much damage on a success. The apparitions then disappear."
                    ]
                  }
                ]
              }
            ]
          }
        ],
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://raw.githubusercontent.com/heisch/dnd_homebrew_content/main/img/deimos.jpeg"
            }
          }
        ]
      },
      "isNamedCreature": true,
      "isNpc": true
    },
    {
      "name": "Mordak Icemourne",
      "source": "nhb",
      "size": "M",
      "type": {
        "type": "humanoid",
        "tags": [
          "Human"
        ]
      },
      "alignment": [
        "A"
      ],
      "ac": [
        15,
        {
          "ac": 17,
          "condition": "with {@spell mage armor}",
          "braces": true
        }
      ],
      "hp": {
        "formula": "24d8 + 40",
        "average": 148
      },
      "speed": {
        "walk": 30
      },
      "str": 11,
      "dex": 16,
      "con": 14,
      "int": 20,
      "wis": 12,
      "cha": 14,
      "save": {
        "int": "+9",
        "wis": "+5"
      },
      "skill": {
        "arcana": "+9",
        "history": "+9"
      },
      "passive": 11,
      "languages": [
        "Common",
        "Draconic",
        "Dwarvish",
        "Elvish",
        "Infernal"
      ],
      "cr": "10",
      "spellcasting": [
        {
          "name": "Spellcasting",
          "headerEntries": [
            "Mordak is a 13th-level spellcaster. Its spellcasting ability is Intelligence (spell save {@dc 17}, {@hit 9} to hit with spell attacks). Mordak has the following wizard spells prepared:"
          ],
          "footerEntries": [
            "*Abjuration spell of 1st level or higher"
          ],
          "spells": {
            "0": {
              "spells": [
                "{@spell blade ward}",
                "{@spell dancing lights}",
                "{@spell mending}",
                "{@spell message}",
                "{@spell ray of frost}"
              ]
            },
            "1": {
              "spells": [
                "{@spell alarm}*",
                "{@spell mage armor}",
                "{@spell magic missile}",
                "{@spell shield}*"
              ],
              "slots": 4
            },
            "2": {
              "spells": [
                "{@spell arcane lock}*",
                "{@spell invisibility}"
              ],
              "slots": 3
            },
            "3": {
              "spells": [
                "{@spell counterspell}*",
                "{@spell dispel magic}*",
                "{@spell fireball}"
              ],
              "slots": 3
            },
            "4": {
              "spells": [
                "{@spell banishment}*",
                "{@spell stoneskin}*"
              ],
              "slots": 3
            },
            "5": {
              "spells": [
                "{@spell cone of cold}",
                "{@spell wall of force}"
              ],
              "slots": 2
            },
            "6": {
              "spells": [
                "{@spell flesh to stone}",
                "{@spell globe of invulnerability}*",
                "{@spell mass suggestion}"
              ],
              "slots": 1
            },
            "7": {
              "spells": [
                "{@spell symbol}*",
                "{@spell teleport}"
              ],
              "slots": 1
            }
          },
          "ability": "int",
          "type": "spellcasting"
        }
      ],
      "trait": [
        {
          "name": "Arcane Ward",
          "entries": [
            "Mordak has a magical ward that has 30 hit points. Whenever Mordak takes damage, the ward takes the damage instead. If the ward is reduced to 0 hit points, Mordak takes any remaining damage. When Morak casts an abjuration spell of 1st level or higher, the ward regains a number of hit points equal to twice the level of the spell."
          ]
        }
      ],
      "action": [
        {
          "name": "Quarterstaff",
          "entries": [
            "{@atk mw} {@hit 3} to hit, reach 5 ft., one target. {@h}2 ({@damage 1d6 - 1}) bludgeoning damage, or 3 ({@damage 1d8 - 1}) bludgeoning damage if used with two hands."
          ]
        }
      ],
      "environment": [
        "urban"
      ],
      "languageTags": [
        "C",
        "DR",
        "D",
        "E",
        "I"
      ],
      "damageTags": [
        "B"
      ],
      "spellcastingTags": [
        "CW"
      ],
      "miscTags": [
        "MW"
      ],
      "hasFluff": true,
      "tokenUrl": "https://raw.githubusercontent.com/heisch/dnd_homebrew_content/main/img/mordak_token.png",
      "fluff": {
        "name": "Abjurer",
        "source": "VGM",
        "entries": [
          {
            "type": "entries",
            "entries": [
              {
                "type": "entries",
                "entries": [
                  {
                    "type": "entries",
                    "entries": [
                      "Abjurers are specialist wizards who feel secure when warded by layers of magical power. Kings, nobles, and other wealthy individuals commonly hire abjurers to cast protective spells on their homes and vaults."
                    ]
                  }
                ]
              }
            ]
          }
        ],
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://raw.githubusercontent.com/heisch/dnd_homebrew_content/main/img/mordak.jpeg"
            }
          }
        ]
      },
      "isNpc": true,
      "shortName": "Mordak",
      "senses": [
        "darkvision 60 ft."
      ],
      "senseTags": [
        "D"
      ],
      "isNamedCreature": true
    },
    {
      "name": "Orc Druid",
      "source": "nhb",
      "size": "M",
      "type": {
        "type": "humanoid",
        "tags": [
          "orc"
        ]
      },
      "alignment": [
        "C",
        "E"
      ],
      "ac": [
        {
          "ac": 14,
          "from": [
            "{@item hide armor|phb}"
          ]
        }
      ],
      "hp": {
        "formula": "9d8 + 18",
        "average": 58
      },
      "speed": {
        "walk": 30
      },
      "str": 10,
      "dex": 14,
      "con": 12,
      "int": 13,
      "wis": 16,
      "cha": 13,
      "skill": {
        "medicine": "+5",
        "persuasion": "+3",
        "nature": "+5"
      },
      "passive": 13,
      "languages": [
        "any two languages"
      ],
      "cr": "3",
      "spellcasting": [
        {
          "name": "Spellcasting",
          "headerEntries": [
            "The orc druid is a 5th-level spellcaster. Its spellcasting ability is Wisdom (spell save {@dc 13}, {@hit 5} to hit with spell attacks). The orc druid has the following spells prepared:"
          ],
          "spells": {
            "0": {
              "spells": [
                "{@spell frostbite|XGE}",
                "{@spell shillelagh}",
                "{@spell thorn whip}"
              ]
            },
            "1": {
              "spells": [
                "{@spell cure wounds}",
                "{@spell faerie fire}",
                "{@spell fog cloud}",
                "{@spell healing word}"
              ],
              "slots": 4
            },
            "2": {
              "spells": [
                "{@spell hold person}",
                "{@spell lesser restoration}",
                "{@spell misty step}"
              ],
              "slots": 3
            },
            "3": {
              "spells": [
                "{@spell lightning bolt}",
                "{@spell thunder step|XGE}"
              ],
              "slots": 2
            }
          },
          "ability": "wis",
          "type": "spellcasting"
        }
      ],
      "trait": [
        {
          "name": "Aggressive",
          "entries": [
            "As a bonus action, the orc druid can move up to its speed toward a hostile creature that it can see."
          ]
        }
      ],
      "action": [
        {
          "name": "Club (shillelagh)",
          "entries": [
            "{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}9 ({@damage 1d8 + 5}) bludgeoning damage."
          ]
        }
      ],
      "languageTags": [
        "X"
      ],
      "damageTags": [
        "B"
      ],
      "spellcastingTags": [
        "CD"
      ],
      "miscTags": [
        "MW"
      ],
      "hasFluff": true,
      "tokenUrl": "https://5e.tools/img/DIP/Anchorite%20of%20Talos.png",
      "senses": [
        "darkvision 60 ft."
      ],
      "senseTags": [
        "D"
      ],
      "traitTags": [
        "Aggressive"
      ]
    },
    {
      "name": "Tiny Fire Elemental",
      "source": "nhb",
      "size": "T",
      "type": "elemental",
      "alignment": [
        "N"
      ],
      "ac": [
        {
          "ac": 14,
          "from": [
            "natural armor"
          ]
        }
      ],
      "hp": {
        "formula": "15d4 + 15",
        "average": 52
      },
      "speed": {
        "walk": 50
      },
      "str": 8,
      "dex": 14,
      "con": 12,
      "int": 6,
      "wis": 10,
      "cha": 8,
      "senses": [
        "darkvision 60 ft."
      ],
      "passive": 10,
      "resist": [
        {
          "resist": [
            "bludgeoning",
            "piercing",
            "slashing"
          ],
          "note": "from nonmagical attacks",
          "cond": true
        }
      ],
      "immune": [
        "fire",
        "poison"
      ],
      "conditionImmune": [
        "exhaustion",
        "grappled",
        "paralyzed",
        "petrified",
        "poisoned",
        "prone",
        "restrained",
        "unconscious"
      ],
      "languages": [
        "Ignan"
      ],
      "cr": "1/2",
      "trait": [
        {
          "name": "Fire Form",
          "entries": [
            "The elemental can move through a space as narrow as 1 inch wide without squeezing. A creature that touches the elemental or hits it with a melee attack while within 5 feet of it takes 1 ({@damage 1d4}) fire damage. In addition, the elemental can enter a hostile creature's space and stop there. The first time it enters a creature's space on a turn, that creature takes 1 ({@damage 1d4}) fire damage and catches fire; until someone takes an action to douse the fire, the creature takes 1 ({@damage 1d4}) fire damage at the start of each of its turns."
          ]
        },
        {
          "name": "Illumination",
          "entries": [
            "The elemental sheds bright light in a 30-foot radius and dim light in an additional 30 feet."
          ]
        },
        {
          "name": "Water Susceptibility",
          "entries": [
            "For every 5 feet the elemental moves in water, or for every gallon of water splashed on it, it takes 1 cold damage."
          ]
        }
      ],
      "action": [
        {
          "name": "Multiattack",
          "entries": [
            "The elemental makes two touch attacks."
          ]
        },
        {
          "name": "Touch",
          "entries": [
            "{@atk mw} {@hit 3} to hit, reach 5 ft., one target. {@h}2 ({@damage 1d4}) fire damage. If the target is a creature or a flammable object, it ignites. Until a creature takes an action to douse the fire, the target takes 1 ({@damage 1d4  -1}) fire damage at the start of each of its turns."
          ]
        }
      ],
      "traitTags": [
        "Illumination"
      ],
      "senseTags": [
        "D"
      ],
      "actionTags": [
        "Multiattack"
      ],
      "languageTags": [
        "IG"
      ],
      "damageTags": [
        "F",
        "C"
      ],
      "miscTags": [
        "MW",
        "AOE"
      ],
      "hasFluff": true,
      "hasFluffImages": true,
      "tokenUrl": "https://raw.githubusercontent.com/heisch/dnd_homebrew_content/main/img/tiny_fire_elemental_token.png",
      "fluff": {
        "entries": [
          {
            "type": "entries",
            "entries": [
              {
                "type": "entries",
                "entries": [
                  "A faint humanoid shape threads through the core of this wild, moving flame. A fire elemental is a force of capricious devastation. Wherever it moves, it sets its surroundings ablaze, turning the world to ash, smoke, and cinders. Water can halt its destructive progress, causing the fire elemental to shrink back, hissing and smoking in pain and rage."
                ]
              }
            ]
          },
          "Elementals are incarnations of the elements that make up the universe: air, earth, fire, and water. Though little more than animated energy on their own planes of existence, they can be called on by spellcasters and powerful beings to take shape and perform tasks.",
          {
            "type": "entries",
            "entries": [
              {
                "type": "entries",
                "entries": [
                  {
                    "type": "entries",
                    "name": "Living Elements",
                    "entries": [
                      "On its home plane, an elemental is a bodiless life force. Its dim consciousness manifests as a physical shape only when focused by the power of magic. A wild spirit of elemental force has no desire except to course through the element of its native plane. Like beasts of the Material Plane, these elemental spirits have no society or culture, and little sense of being."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Conjured by Magic",
                    "entries": [
                      "Certain spells and magic items can conjure an elemental, summoning it from the Inner Planes to the Material Plane. Elementals instinctively resent being pulled from their native planes and bound into service. A creature that summons an elemental must assert force of will to control it."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Bound and Shaped",
                    "entries": [
                      "Powerful magic can bind an elemental spirit into a material template that defines a specific use and function. Invisible stalkers are air elementals bound to a specific form, in the same way that water elementals can be shaped into water weirds."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Elemental Nature",
                    "entries": [
                      "An elemental doesn't require air, food, drink, or sleep."
                    ]
                  }
                ]
              }
            ]
          }
        ],
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://raw.githubusercontent.com/heisch/dnd_homebrew_content/main/img/tiny_fire_elemental.jpg"
            }
          }
        ]
      },
      "save": {
        "dex": "+4"
      },
      "vulnerable": [
        "cold"
      ],
      "environment": [
        "desert"
      ]
    },
    {
      "name": "Troll (Action Oriented)",
      "size": "L",
      "type": "giant",
      "source": "nhb",
      "alignment": [
        "C",
        "E"
      ],
      "ac": [
        {
          "ac": 16,
          "from": [
            "natural armor"
          ]
        }
      ],
      "hp": {
        "formula": "12d10 + 60",
        "average": 126
      },
      "speed": {
        "walk": 40
      },
      "str": 18,
      "dex": 13,
      "con": 20,
      "int": 8,
      "wis": 10,
      "cha": 8,
      "passive": 12,
      "cr": "7",
      "tokenUrl": "https://5e.tools/img/MM/Troll.png",
      "fluff": {
        "entries": [
          "Born with horrific appetites, trolls eat anything they can catch and devour. They have no society to speak of, but they do serve as mercenaries to orcs, ogres, ettins, hags, and giants. As payment, trolls demand food and treasure. Trolls are difficult to control, however, doing as they please even when working with more powerful creatures.",
          "Regeneration. Smashing a troll's bones and slashing through its rubbery hide only makes it angry. A troll's wounds close quickly. If the monster loses an arm, a leg, or even its head, those dismembered parts can sometimes act with a life of their own. A troll can even reattach severed body parts, untroubled by its momentary disability. Only acid and fire can arrest the regenerative properties of a troll's flesh. The trolls, enraged, will attack individuals making acid and fire attacks against them above all other prey.",
          "Troll Freaks. Their regenerative capabilities make trolls especially susceptible to mutation. Although uncommon, such transformations can result from what the troll has done or what has been done to it. A decapitated troll might grow two heads from the stump of its neck, while a troll that eats a fey creature might gain one or more of that creature's traits."
        ],
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://5e.tools/img/bestiary/MM/Troll.jpg"
            }
          }
        ]
      },
      "languages": [
        "Giant"
      ],
      "languageTags": [
        "GI"
      ],
      "action": [
        {
          "name": "Multiattack",
          "entries": [
            "The troll makes three attacks: two with its claws and one with its bite. If both claw attacks hit: The target is considered {@condition grappled} (escape {@dc 15}). Until the grapple ends, the target is {@condition restrained}  and has disadvantage on Strength checks and Strength saving throws."
          ]
        },
        {
          "name": "Swipe",
          "entries": [
            "The troll makes a Claw attack against all targets in melee range in a 180 degree arc."
          ]
        },
        {
          "name": "Claw",
          "entries": [
            "{@atk mw} {@hit 7} to hit, reach 5 ft., one target. {@h}13 ({@damage 2d8 + 4}) slashing damage."
          ]
        },
        {
          "name": "Bite",
          "entries": [
            "{@atk mw} {@hit 7} to hit, reach 5 ft., one target. {@h}11 ({@damage 2d6 + 4}) piercing damage."
          ]
        }
      ],
      "conditionInflict": [
        "grappled",
        "restrained",
        "prone"
      ],
      "actionTags": [
        "Multiattack"
      ],
      "damageTags": [
        "S",
        "P",
        "B"
      ],
      "miscTags": [
        "MW",
        "AOE"
      ],
      "bonus": [
        {
          "name": "Cunning",
          "entries": [
            "The Trolls agility allows him to move and act quickly. This action can be used to take the {@action Dash} or {@action Disengage} action."
          ]
        }
      ],
      "trait": [
        {
          "name": "Regeneration (Troll)",
          "entries": [
            "The troll (action oriented) regains 15 hit points at the start of its turn. If the troll (action oriented) takes acid or fire damage, this trait doesn't function at the start of the troll (action oriented)'s next turn. The troll (action oriented) dies only if it starts its turn with 0 hit points and doesn't regenerate."
          ]
        },
        {
          "name": "Keen Smell",
          "entries": [
            "The troll (action oriented) has advantage on Wisdom ({@skill Perception}) checks that rely on smell."
          ]
        }
      ],
      "traitTags": [
        "Keen Senses",
        "Regeneration"
      ],
      "reaction": [
        {
          "name": "Vicious",
          "entries": [
            "When a melee attack misses by more than 5 points the Troll can - unless it's currently grappling someone - use it's reaction to make a melee attack against the attacker."
          ]
        }
      ],
      "legendaryHeader": [
        "The troll can take 3 villainous actions, choosing from the options below. Every villainous action can only be used once per fight at the end of another creature's turn and only one villainous action can be used per combat round."
      ],
      "legendary": [
        {
          "name": "Troll Smash",
          "entries": [
            "The troll jumps at a target within 30 feet of it. The target must succeed on a Dexterity saving throw ({@dc 15}). On a failed safe the target takes 10 ({@damage 3d6}) bludgeoning damage is knocked {@condition prone} and considered {@condition restrained} (escape {@dc 15}). This action does not provoke opportunity attacks."
          ]
        },
        {
          "name": "Stinking Breath",
          "entries": [
            "The troll creates a 20-foot-radius sphere of nauseating gas centered on itself. The cloud spreads around corners. The cloud lingers in the air for two rounds. Each creature that is completely within the cloud at the start of its turn must make a Constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don't need to breathe or are immune to poison automatically succeed on this saving throw."
          ]
        },
        {
          "name": "Frenzy",
          "entries": [
            "The troll makes five claw attacks at disadvantage."
          ]
        }
      ],
      "environment": [
        "arctic",
        "forest",
        "hill",
        "mountain",
        "swamp",
        "underdark"
      ],
      "senses": [
        "darkvision 60 ft."
      ],
      "senseTags": [
        "D"
      ],
      "skill": {
        "perception": "+2"
      },
      "resist": []
    },
    {
      "name": "Undead Champion",
      "source": "nhb",
      "size": "M",
      "type": "undead",
      "alignment": [
        "A"
      ],
      "ac": [
        {
          "ac": 18,
          "from": [
            "{@item plate armor|phb}"
          ]
        }
      ],
      "hp": {
        "average": 143,
        "formula": "22d8 + 44"
      },
      "speed": {
        "walk": 30
      },
      "str": 20,
      "dex": 15,
      "con": 14,
      "int": 10,
      "wis": 14,
      "cha": 12,
      "save": {
        "str": "+9",
        "con": "+6"
      },
      "skill": {
        "athletics": "+9",
        "intimidation": "+5",
        "perception": "+6"
      },
      "passive": 16,
      "senses": [
        "darkvision 60 ft."
      ],
      "senseTags": [
        "D"
      ],
      "languages": [
        "any one language (usually Common)"
      ],
      "cr": "9",
      "trait": [
        {
          "name": "Indomitable (2/Day)",
          "entries": [
            "The champion rerolls a failed saving throw."
          ]
        },
        {
          "name": "Second Wind (Recharges after a Short or Long Rest)",
          "entries": [
            "As a bonus action, the champion can regain 20 hit points."
          ]
        }
      ],
      "action": [
        {
          "name": "Multiattack",
          "entries": [
            "The champion makes three attacks with its greatsword or its shortbow."
          ]
        },
        {
          "name": "Greatsword",
          "entries": [
            "{@atk mw} {@hit 9} to hit, reach 5 ft., one target. {@h}12 ({@damage 2d6 + 5}) slashing damage, plus 7 ({@damage 2d6}) slashing damage if the champion has more than half of its total hit points remaining."
          ]
        },
        {
          "name": "Shortbow",
          "entries": [
            "{@atk rw} {@hit 6} to hit, range 80/320 ft., one target. {@h}5 ({@damage 1d6 + 2}) piercing damage, plus 7 ({@damage 2d6}) piercing damage if the champion has more than half of its total hit points remaining."
          ]
        }
      ],
      "environment": [
        "desert",
        "urban"
      ],
      "actionTags": [
        "Multiattack"
      ],
      "languageTags": [
        "C",
        "X"
      ],
      "damageTags": [
        "S",
        "P"
      ],
      "miscTags": [
        "MW",
        "RW",
        "RNG"
      ],
      "hasFluff": true,
      "hasFluffImages": true,
      "tokenUrl": "https://5e.tools/img/VGM/Champion.png",
      "fluff": {
        "name": "Champion",
        "source": "VGM",
        "entries": [
          {
            "type": "entries",
            "entries": [
              {
                "type": "entries",
                "entries": [
                  {
                    "type": "entries",
                    "entries": [
                      "Champions are mighty warriors who honed their fighting skills in wars or gladiatorial pits. To soldiers and other people who fight for a living, champions are as influential as nobles, and their presence is courted as a sign of status among rulers."
                    ]
                  }
                ]
              }
            ]
          }
        ],
        "images": [
          {
            "type": "image",
            "href": {
              "type": "internal",
              "path": "bestiary/VGM/Champion.jpg"
            }
          }
        ]
      },
      "immune": [
        "poison"
      ],
      "resist": [
        "necrotic"
      ]
    },
    {
      "name": "Undead Veteran",
      "source": "nhb",
      "size": "M",
      "type": {
        "type": "undead"
      },
      "alignment": [
        "A"
      ],
      "ac": [
        {
          "ac": 17,
          "from": [
            "{@item splint armor|phb}"
          ]
        }
      ],
      "hp": {
        "average": 58,
        "formula": "9d8 + 18"
      },
      "speed": {
        "walk": 30
      },
      "str": 16,
      "dex": 13,
      "con": 14,
      "int": 10,
      "wis": 11,
      "cha": 10,
      "skill": {
        "athletics": "+5",
        "perception": "+2"
      },
      "passive": 12,
      "senses": [
        "darkvision 60 ft."
      ],
      "senseTags": [
        "D"
      ],
      "languages": [
        "understands all languages it spoke in life but can't speak"
      ],
      "cr": "3",
      "action": [
        {
          "name": "Multiattack",
          "entries": [
            "The veteran makes two longsword attacks. If it has a shortsword drawn, it can also make a shortsword attack."
          ]
        },
        {
          "name": "Longsword",
          "entries": [
            "{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}7 ({@damage 1d8 + 3}) slashing damage, or 8 ({@damage 1d10 + 3}) slashing damage if used with two hands."
          ]
        },
        {
          "name": "Shortsword",
          "entries": [
            "{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}6 ({@damage 1d6 + 3}) piercing damage."
          ]
        },
        {
          "name": "Heavy Crossbow",
          "entries": [
            "{@atk rw} {@hit 3} to hit, range 100/400 ft., one target. {@h}6 ({@damage 1d10 + 1}) piercing damage."
          ]
        }
      ],
      "actionTags": [
        "Multiattack"
      ],
      "languageTags": [
        "CS",
        "LF"
      ],
      "damageTags": [
        "S",
        "P"
      ],
      "miscTags": [
        "MW",
        "RW",
        "RNG"
      ],
      "hasFluff": true,
      "tokenUrl": "https://5e.tools/img/MM/Veteran.png",
      "fluff": {
        "name": "Veteran",
        "source": "MM",
        "entries": [
          {
            "type": "entries",
            "entries": [
              {
                "type": "entries",
                "entries": [
                  "Veterans are professional fighters that take up arms for pay or to protect something they believe in or value. Their ranks include soldiers retired from long service and warriors who never served anyone but themselves."
                ]
              }
            ]
          }
        ]
      },
      "resist": [
        "necrotic"
      ],
      "immune": [
        "poison"
      ]
    },
    {
      "name": "Young Adult Black Dragon",
      "source": "nhb",
      "size": "H",
      "type": "dragon",
      "alignment": [
        "C",
        "E"
      ],
      "ac": [
        {
          "ac": 18,
          "from": [
            "natural armor"
          ]
        }
      ],
      "hp": {
        "average": 158,
        "formula": "15d12 + 60"
      },
      "speed": {
        "walk": 40,
        "fly": 80,
        "swim": 40
      },
      "str": 21,
      "dex": 14,
      "con": 19,
      "int": 13,
      "wis": 12,
      "cha": 16,
      "save": {
        "dex": "+6",
        "con": "+8",
        "wis": "+5",
        "cha": "+7"
      },
      "skill": {
        "perception": "+9",
        "stealth": "+6"
      },
      "senses": [
        "blindsight 60 ft.",
        "darkvision 120 ft."
      ],
      "passive": 19,
      "immune": [
        "acid"
      ],
      "languages": [
        "Common",
        "Dragonic"
      ],
      "cr": "10",
      "trait": [
        {
          "name": "Amphibious",
          "entries": [
            "The dragon can breathe air and water."
          ]
        }
      ],
      "action": [
        {
          "name": "Multiattack",
          "entries": [
            "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."
          ]
        },
        {
          "name": "Bite",
          "entries": [
            "{@atk mw} {@hit 9} to hit, reach 10 ft., one target. {@h}16 ({@damage 2d10 + 5}) piercing damage plus 4 ({@damage 1d8}) acid damage."
          ]
        },
        {
          "name": "Claw",
          "entries": [
            "{@atk mw} {@hit 9} to hit, reach 5 ft., one target. {@h}12 ({@damage 2d6 + 5}) slashing damage."
          ]
        },
        {
          "name": "Frightful Presence",
          "entries": [
            "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a {@dc 15} Wisdom saving throw or become {@condition frightened} for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."
          ]
        },
        {
          "name": "Acid Breath {@recharge 5}",
          "entries": [
            "The dragon exhales acid in an 60-foot line that is 5 feet wide. Each creature in that line must succeed on a {@dc 15} Dexterity saving throw, taking 54 ({@damage 12d8}) acid damage on a failed save, or half as much damage on a successful one."
          ]
        }
      ],
      "traitTags": [
        "Amphibious"
      ],
      "senseTags": [
        "B",
        "SD"
      ],
      "actionTags": [
        "Frightful Presence",
        "Multiattack"
      ],
      "languageTags": [
        "C"
      ],
      "damageTags": [
        "P",
        "A",
        "S"
      ],
      "miscTags": [
        "MW",
        "RCH",
        "AOE"
      ],
      "conditionInflict": [
        "frightened"
      ],
      "fluff": {
        "entries": [
          {
            "type": "entries",
            "entries": [
              {
                "type": "entries",
                "entries": [
                  "The most evil-tempered and vile of the chromatic dragons, black dragons collect the wreckage and treasures of fallen peoples. These dragons loathe seeing the weak prosper and revel in the collapse of humanoid kingdoms. They make their homes in fetid swamps and crumbling ruins where kingdoms once stood.",
                  "With deep-socketed eyes and broad nasal openings, a black dragon's face resembles a skull. Its curving, segmented horns are bone-colored near the base and darken to dead black at the tips. As a black dragon ages, the flesh around its horns and cheekbones deteriorates as though eaten by acid, leaving thin layers of hide that enhance its skeletal appearance. A black dragon's head is marked by spikes and horns. Its tongue is flat with a forked tip, drooling slime whose acidic scent adds to the dragon's reek of rotting vegetation and foul water.",
                  "When it hatches, a black dragon has glossy black scale. As it ages, its scales become thicker and duller, helping it blend in to the marshes and blasted ruins that are its home.",
                  {
                    "name": "Brutal and Cruel",
                    "type": "entries",
                    "entries": [
                      "All chromatic dragons are evil, but black dragons stand apart for their sadistic nature. A black dragon lives to watch its prey beg for mercy, and will often offer the illusion of respite or escape before finishing off its enemies.",
                      "A black dragon strikes at its weakest enemies first, ensuring a quick and brutal victory, which bolsters its ego as it terrifies its remaining foes. On the verge of defeat, a black dragon does anything it can to save itself, but it accepts death before allowing any other creature to claim mastery over it."
                    ]
                  },
                  {
                    "name": "Foes and Servants",
                    "type": "entries",
                    "entries": [
                      "Black dragons hate and fear other dragons. They spy on draconic rivals from afar, looking for opportunities to slay weaker dragons and avoid stronger ones. If a stronger dragon threatens it, a black dragon abandons its lair and seeks out new territory.",
                      "Evil lizardfolk venerate and serve black dragons, raiding humanoid settlements for treasure and food to give as tribute and building crude draconic effigies along the borders of their dragon master's domain.",
                      "A black dragon's malevolent influence might also cause the spontaneous creation of evil shambling mounds that seek out and slay good creatures approaching the dragon's lair.",
                      "Kobolds infest the lairs of many black dragons like vermin. They become as cruel as their dark masters, often torturing and weakening captives with centipede bites and scorpion stings before delivering them to sate the dragon's hunger."
                    ]
                  },
                  {
                    "name": "Wealth of the Ancients",
                    "type": "entries",
                    "entries": [
                      "Black dragons hoard the treasures and magic items of crumbled empires and conquered kingdoms to remind themselves of their greatness. The more civilizations a dragon outlasts, the more entitled it feels to claim the wealth of current civilizations for itself."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "A Black Dragon's Lair",
                    "entries": [
                      "Black dragons dwell in swamps on the frayed edges of civilization. A black dragon's lair is a dismal cave, grotto, or ruin that is at least partially flooded, providing pools where the dragon rests, and where its victims can ferment. The lair is littered with the acid-pitted bones of previous victims and the fly-ridden carcasses of fresh kills, watched over by crumbling statues. Centipedes, scorpions, and snakes infest the lair, which is filled with the stench of death and decay."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "type": "entries",
            "name": "Chromatic Dragons",
            "entries": [
              "The black, blue, green, red, and white dragons represent the evil side of dragonkind. Aggressive, gluttonous, and vain, chromatic dragons are dark sages and powerful tyrants feared by all creatures-including each other.",
              {
                "name": "Driven by Greed",
                "entries": [
                  " Chromatic dragons lust after treasure, and this greed colors their every scheme and plot. They believe that the world's wealth belongs to them by right, and a chromatic dragon seizes that wealth without regard for the humanoids and other creatures that have \"stolen\" it. With its piles of coins, gleaming gems, and magic items, a dragon's hoard is the stuff of legend. However, chromatic dragons have no interest in commerce, amassing wealth for no other reason than to have it."
                ],
                "type": "entries"
              },
              {
                "name": "Creatures of Ego",
                "type": "entries",
                "entries": [
                  "Chromatic dragons are united by their sense of superiority, believing themselves the most powerful and worthy of all mortal creatures. When they interact with other creatures, it is only to further their own interests. They believe in their innate right to rule, and this belief is the cornerstone of every chromatic dragon's personality and worldview. Trying to humble a chromatic dragon is like trying to convince the wind to stop blowing. To these creatures, humanoids are animals, fit to serve as prey or beasts of burden, and wholly unworthy of respect."
                ]
              },
              {
                "name": "Dangerous Lairs",
                "type": "entries",
                "entries": [
                  "A dragon's lair serves as the seat of its power and a vault for its treasure. With its innate toughness and tolerance for severe environmental effects, a dragon selects or builds a lair not for shelter but for defense, favoring multiple entrances and exits, and security for its hoard.",
                  "Most chromatic dragon lairs are hidden in dangerous and remote locations to prevent all but the most audacious mortals from reaching them. A black dragon might lair in the heart of a vast swamp, while a red dragon might claim the caldera of an active volcano. In addition to the natural defenses of their lairs, powerful chromatic dragons use magical guardians, traps, and subservient creatures to protect their treasures."
                ]
              },
              {
                "name": "Queen of Evil Dragons",
                "type": "entries",
                "entries": [
                  "Tiamat the Dragon Queen is the chief deity of evil dragonkind. She dwells on Avernus, the first layer of the Nine Hells. As a lesser god, Tiamat has the power to grant spells to her worshipers, though she is loath to share her power. She epitomizes the avarice of evil dragons, believing that the multiverse and all its treasures will one day be hers and hers alone.",
                  "Tiamat is a gigantic dragon whose five heads reflect the forms of the chromatic dragons that worship her-black, blue, green, red, and white. She is a terror on the battlefield, capable of annihilating whole armies with her five breath weapons, her formidable spellcasting, and her fearsome claws.",
                  "Tiamat's most hated enemy is Bahamut the Platinum Dragon, with whom she shares control of the faith of dragonkind. She also holds a special enmity for Asmodeus, who long ago stripped her of the rule of Avernus and who continues to curb the Dragon Queen's power."
                ]
              }
            ]
          },
          "True dragons are winged reptiles of ancient lineage and fearsome power. They are known and feared for their predatory cunning and greed, with the oldest dragons accounted as some of the most powerful creatures in the world. Dragons are also magical creatures whose innate power fuels their dreaded breath weapons and other preternatural abilities.",
          "Many creatures, including wyverns and dragon turtles, have draconic blood. However, true dragons fall into the two broad categories of chromatic and metallic dragons. The black, blue, green, red, and white dragons are selfish, evil, and feared by all. The brass, bronze, copper, gold, and silver dragons are noble, good, and highly respected by the wise.",
          "Though their goals and ideals vary tremendously, all true dragons covet wealth, hoarding mounds of coins and gathering gems, jewels, and magic items. Dragons with large hoards are loath to leave them for long, venturing out of their lairs only to patrol or feed.",
          "True dragons pass through four distinct stages of life, from lowly wyrmlings to ancient dragons, which can live for over a thousand years. In that time, their might can become unrivaled and their hoards can grow beyond price.",
          "Dragon Age Categories",
          {
            "type": "table",
            "colLabels": [
              "Category",
              "Size",
              "Age Range"
            ],
            "colStyles": [
              "col-4",
              "col-4",
              "col-4"
            ],
            "rows": [
              [
                "Wyrmling",
                "Medium",
                "5 years or less"
              ],
              [
                "Young",
                "Large",
                "6100 years"
              ],
              [
                "Adult",
                "Huge",
                "101800 years"
              ],
              [
                "Ancient",
                "Gargantuan",
                "801 years or more"
              ]
            ]
          }
        ],
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://5e.tools/img/bestiary/MM/Black Dragon.jpg"
            }
          }
        ]
      },
      "environment": [
        "swamp"
      ],
      "group": "Chromatic Dragon",
      "dragonCastingColor": "B",
      "tokenUrl": "https://5e.tools/img/MM/Young Black Dragon.png"
    }
  ]
}
